In [2]:
import pandas as pd 
import numpy as np

In [5]:
data = pd.read_csv('https://s3.eu-west-1.amazonaws.com/course.oc-static.com/courses/7410486/course%2B-%2BQuiz%2BP2-V2.csv', delimiter=';')
data

     Position Sexe     Temps  Dept Temps_secondes   Age
0           1    M  00:32:23    76           1943  40.0
1           2    M  00:32:40    27           1960  34.0
2           3    M  00:33:15    76           1995  44.0
3           4    M  00:33:23    76           2003  46.0
4           5    M  00:33:29    76           2009  26.0
..        ...  ...       ...   ...            ...   ...
335       336    F  01:08:34    27           4114  41.0
336       337    F  01:08:36    27           4116  48.0
337       338    M  01:09:31    27           4171  24.0
338       339    F  01:09:31    27           4171  25.0
339       340    F  01:10:31    76           4231  41.0

[340 rows x 6 columns]

In [9]:
VALID_CITY = [76, 27, 14]
mask =  ~data['Dept'].isin(VALID_CITY)
df = data.loc[mask, :]
df

     Position Sexe     Temps  Dept Temps_secondes   Age
21         22    M  00:36:22    78           2182  40.0
35         36    M  00:37:31    78           2251  42.0
74         75    M  00:42:06    78           2526  57.0
255       256    M  00:55:08    78           3308  42.0
289       290    F  00:59:09    78           3549  43.0

In [17]:
data_na = data.isnull().sum()
data_na

Position          0
Sexe              2
Temps             0
Dept              0
Temps_secondes    0
Age               4
dtype: int64

In [28]:
data.loc[data[['Position', 'Sexe', 'Temps', 'Dept', 'Temps_secondes', 'Age']].duplicated(keep=False), :]

Empty DataFrame
Columns: [Position, Sexe, Temps, Dept, Temps_secondes, Age]
Index: []

In [30]:
data.isnull().sum()

Position          0
Sexe              2
Temps             0
Dept              0
Temps_secondes    0
Age               4
dtype: int64